InformationRegisters/ТелеграмСообщенияИсходящиеОтправленные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмСообщенияИсходящиеОтправленные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СообщениеИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелеграмСообщенияИсходящие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмСообщенияИсходящиеОтправленные/Ext/ManagerModule.bsl
Функция ПолучитьДокСообщенияПоИД(СообщениеИД) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТелеграмСообщенияИсходящиеОтправленные.Сообщение КАК Сообщение
	               |ИЗ
	               |	РегистрСведений.ТелеграмСообщенияИсходящиеОтправленные КАК ТелеграмСообщенияИсходящиеОтправленные
	               |ГДЕ
	               |	ТелеграмСообщенияИсходящиеОтправленные.СообщениеИД = &СообщениеИД";
	Запрос.УстановитьПараметр("СообщениеИД", СообщениеИД);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Сообщение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции
